Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.SetActiveDrawing Method (Drawing, Boolean)
 Sets the active drawing that is currently open in Tekla Structures.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetActiveDrawing(
	Drawing drawing,
	bool showDrawing
)
Public Function SetActiveDrawing (
	drawing As Drawing,
	showDrawing As Boolean
) As Boolean
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
The drawing to be set as the active drawing.
showDrawing
Type: System.Boolean
Whether to open the drawing as visible or in the background (faster).
Return Value
Type: Boolean
True on success.
Exceptions
Exception | Condition
CannotPerformOperationDrawingNotUpToDateException | Thrown if the drawing is not up to date.
See Also
Reference
DrawingHandler Class
SetActiveDrawing Overload
Tekla.Structures.Drawing Namespace